In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [3]:
Startsalary = pd.read_excel(r'/Users/siwoolchoi/Desktop/siwooly/대학원/통계와확률/data/StartSalary.xlsx', header=0, index_col='Graduate')

Startsalary

          Starting Salary
Graduate
1                    3450
2                    3550
3                    3650
4                    3480
5                    3355
6                    3310
7                    3490
8                    3730
9                    3540
10                   3925
11                   3520
12                   3480

In [4]:
salary = Startsalary['Starting Salary']
# series
salary

Graduate
1     3450
2     3550
3     3650
4     3480
5     3355
6     3310
7     3490
8     3730
9     3540
10    3925
11    3520
12    3480
Name: Starting Salary, dtype: int64

In [5]:
#평균 구하기 -1 

sum(salary) / len(salary)

3540.0

In [6]:
# 평균 구하기 -2

np.mean(salary)

np.float64(3540.0)

In [7]:
# np.float 출력 안되도록
float(np.mean(salary))

3540.0

In [8]:
np.mean(salary).item()

3540.0

In [9]:
# 정수로 변환
int(np.mean(salary))

3540

In [10]:
# 평균 구하기 -3
salary.mean()

np.float64(3540.0)

In [11]:
float(salary.mean()), salary.mean().item()

(3540.0, 3540.0)

In [12]:
# 정렬 (sorting)
sorted_salary = np.sort(salary)
sorted_salary

array([3310, 3355, 3450, 3480, 3480, 3490, 3520, 3540, 3550, 3650, 3730,
       3925])

In [13]:
# 중앙값 구하기
n = len(sorted_salary)

if n % 2 == 0:
    x0 = sorted_salary[n//2 - 1]
    x1 = sorted_salary[n//2]
    median = (x0 + x1) / 2

else:
    median = sorted_salary[(n+1)//2 - 1]

float(median)

3505.0

In [14]:
# 중앙값 구하기 -2

np.median(salary)

float(np.median(salary))

3505.0

In [15]:
# 최빈값

salary.mode()

0    3480
Name: Starting Salary, dtype: int64

In [ ]:
# 백분위수
# 85%, 50%

float(np.percentile(salary, 85)), float(np.percentile(salary, 50))

(3678.0, 3505.0)

In [18]:
# 기술통계 수치 일괄 출력 -- dataframe에만 사용 가능!

Startsalary.describe()

       Starting Salary
count        12.000000
mean       3540.000000
std         165.652978
min        3310.000000
25%        3472.500000
50%        3505.000000
75%        3575.000000
max        3925.000000

In [ ]:
# 분산 
# 모집단 분산 vs 표본 분산

# 모집단 분산 : 편차 제곱을 합계 ==> 모집단 요소의 갯수로 나눠줌.

# 표본 분산: 편차 제곱을 합계 ==> 표본 크기에서 1을 뺀 값, 즉 자유도로 나눠줌.

# ddof : delta degree of freedom
# ddof : 자유도를 n-1로 한다.

In [21]:
np.var(salary)

25154.166666666668

In [ ]:
np.var(salary, ddof=1)

27440.909090909092

In [22]:
np.var(salary) * 12 / 11

27440.909090909092

In [23]:
# 표준 편차

np.std(salary)

158.60065153291984

In [24]:
float(np.sqrt(np.var(salary)))

158.60065153291984

In [25]:
np.std(salary, ddof=1)

165.65297791138283

In [26]:
salary.var(ddof=1)

27440.909090909092

In [27]:
salary.std(ddof=1)

165.65297791138283